app/Controllers/Mobil.php

SELECT *
FROM `tb_mobil`
---
    public function index()
    {
        $data_Mobil = $this->MobilModel->findAll();