app/Models/MobilModel.php

SELECT *
FROM `tb_mobil`
---
    public function getMobil()
    {
        return $this->findAll();

INSERT INTO `tb_mobil` (`id_mobil`, `nama_mobil`, `tipe_mobil`, `tahun_mobil`, `plat_nomor`, `warna_mobil`, `harga_sewa_per_hari`, `status_mobil`) VALUES ('', 'honda', 'civic', '2022', 'R 3985 VAN', 'Hitam', '500000', 'sendiri')
---
        public function saveMobil($data)
    {
        return $this->save($data);